Словарь/src/DataProcessors/ДозаполнениеМоджи/ДозаполнениеМоджи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ДозаполнениеМоджи</name>
</mdclass:DataProcessor>

Словарь/src/Catalogs/Моджи/Моджи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Моджи</name>
  <comment>1 символ</comment>
  <predefined>
    <items>
      <name>A</name>
      <description>A</description>
    </items>
    <items>
      <name>Ba</name>
      <description>Ba</description>
    </items>
    <items>
      <name>Be</name>
      <description>Be</description>
    </items>
    <items>
      <name>Bi</name>
      <description>Bi</description>
    </items>
    <items>
      <name>Bo</name>
      <description>Bo</description>
    </items>
    <items>
      <name>Bu</name>
      <description>Bu</description>
    </items>
    <items>
      <name>Chi</name>
      <description>Chi</description>
    </items>
    <items>
      <name>Da</name>
      <description>Da</description>
    </items>
    <items>
      <name>De</name>
      <description>De</description>
    </items>
    <items>
      <name>Do</name>
      <description>Do</description>
    </items>
    <items>
      <name>Dzu</name>
      <description>Dzu</description>
    </items>
    <items>
      <name>E</name>
      <description>E</description>
    </items>
    <items>
      <name>Fu</name>
      <description>Fu</description>
    </items>
    <items>
      <name>Ga</name>
      <description>Ga</description>
    </items>
    <items>
      <name>Ge</name>
      <description>Ge</description>
    </items>
    <items>
      <name>Gi</name>
      <description>Gi</description>
    </items>
    <items>
      <name>Go</name>
      <description>Go</description>
    </items>
    <items>
      <name>Gu</name>
      <description>Gu</description>
    </items>
    <items>
      <name>Ha</name>
      <description>Ha</description>
    </items>
    <items>
      <name>He</name>
      <description>He</description>
    </items>
    <items>
      <name>Hi</name>
      <description>Hi</description>
    </items>
    <items>
      <name>Ho</name>
      <description>Ho</description>
    </items>
    <items>
      <name>I</name>
      <description>I</description>
    </items>
    <items>
      <name>Dzi</name>
      <description>Ji</description>
    </items>
    <items>
      <name>Ji</name>
      <description>Ji</description>
    </items>
    <items>
      <name>Ka</name>
      <description>Ka</description>
    </items>
    <items>
      <name>Ke</name>
      <description>Ke</description>
    </items>
    <items>
      <name>Ki</name>
      <description>Ki</description>
    </items>
    <items>
      <name>Ko</name>
      <description>Ko</description>
    </items>
    <items>
      <name>Ku</name>
      <description>Ku</description>
    </items>
    <items>
      <name>Ma</name>
      <description>Ma</description>
    </items>
    <items>
      <name>Me</name>
      <description>Me</description>
    </items>
    <items>
      <name>Mi</name>
      <description>Mi</description>
    </items>
    <items>
      <name>Mo</name>
      <description>Mo</description>
    </items>
    <items>
      <name>Mu</name>
      <description>Mu</description>
    </items>
    <items>
      <name>N</name>
      <description>N</description>
    </items>
    <items>
      <name>Na</name>
      <description>Na</description>
    </items>
    <items>
      <name>Ne</name>
      <description>Ne</description>
    </items>
    <items>
      <name>Ni</name>
      <description>Ni</description>
    </items>
    <items>
      <name>No</name>
      <description>No</description>
    </items>
    <items>
      <name>Nu</name>
      <description>Nu</description>
    </items>
    <items>
      <name>O</name>
      <description>O</description>
    </items>
    <items>
      <name>Pa</name>
      <description>Pa</description>
    </items>
    <items>
      <name>Pe</name>
      <description>Pe</description>
    </items>
    <items>
      <name>Pi</name>
      <description>Pi</description>
    </items>
    <items>
      <name>Po</name>
      <description>Po</description>
    </items>
    <items>
      <name>Pu</name>
      <description>Pu</description>
    </items>
    <items>
      <name>Ra</name>
      <description>Ra</description>
    </items>
    <items>
      <name>Re</name>
      <description>Re</description>
    </items>
    <items>
      <name>Ri</name>
      <description>Ri</description>
    </items>
    <items>
      <name>Ro</name>
      <description>Ro</description>
    </items>
    <items>
      <name>Ru</name>
      <description>Ru</description>
    </items>
    <items>
      <name>Sa</name>
      <description>Sa</description>
    </items>
    <items>
      <name>Se</name>
      <description>Se</description>
    </items>
    <items>
      <name>Shi</name>
      <description>Shi</description>
    </items>
    <items>
      <name>So</name>
      <description>So</description>
    </items>
    <items>
      <name>Su</name>
      <description>Su</description>
    </items>
    <items>
      <name>Ta</name>
      <description>Ta</description>
    </items>
    <items>
      <name>Te</name>
      <description>Te</description>
    </items>
    <items>
      <name>To</name>
      <description>To</description>
    </items>
    <items>
      <name>Tsu</name>
      <description>Tsu</description>
    </items>
    <items>
      <name>U</name>
      <description>U</description>
    </items>
    <items>
      <name>Wa</name>
      <description>Wa</description>
    </items>
    <items>
      <name>Wo</name>
      <description>Wo</description>
    </items>
    <items>
      <name>Ya</name>
      <description>Ya</description>
    </items>
    <items>
      <name>Yo</name>
      <description>Yo</description>
    </items>
    <items>
      <name>Yu</name>
      <description>Yu</description>
    </items>
    <items>
      <name>Za</name>
      <description>Za</description>
    </items>
    <items>
      <name>Ze</name>
      <description>Ze</description>
    </items>
    <items>
      <name>Zo</name>
      <description>Zo</description>
    </items>
    <items>
      <name>Zu</name>
      <description>Zu</description>
    </items>
  </predefined>
  <attributes>
    <name>НаименованиеНаРусском</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Юникод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮникодПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоКатакана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоМиниСимвол</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Словарь/src/DataProcessors/ДозаполнениеМоджи/Forms/Форма/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Дозаполнение(Команда)
	ДозаполнениеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДозаполнениеХираганы(Команда)
	ЗаполнениеХираганыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДозаполнениеКатаканой(Команда)
	ДозаполнениеКатаканойНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДозаполнениеМиниВерсиями(Команда)
	ДозаполнениеМиниСимволамиНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДозаполнениеНаСервере()
	ЗаполнениеХираганыНаСервере();
	ДозаполнениеКатаканойНаСервере();
	ДозаполнениеМиниСимволамиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеХираганыНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Моджи.Ссылка КАК Ссылка,
	|	Моджи.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Моджи КАК Моджи
	|ГДЕ
	|	Моджи.ПометкаУдаления = ЛОЖЬ
	|	И Моджи.ЭтоКатакана = ЛОЖЬ
	|	И Моджи.ЭтоМиниСимвол = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	СоответствиеРК = АзбукаВызовСервера.СоответствиеРомаджиКириллицы();
	СоответствиеРЮ = АзбукаВызовСервера.СоответствиеРомаджиЮникоду();
	
	Пока Выборка.Следующий() Цикл
		
		Моджи = Выборка.Ссылка.ПолучитьОбъект();
		НаименованиеНрег = СоответствиеРК.Получить(НРег(Выборка.Наименование));
		
		Моджи.НаименованиеНаРусском = ВРег(Лев(НаименованиеНрег,1)) + Сред(НаименованиеНрег,2);
		Юникод = СоответствиеРЮ.Получить(НРег(Выборка.Наименование)).Юникод;
		Моджи.Юникод = ЧислоИзШестнадцатеричнойСтроки(Юникод);
		Моджи.ЮникодПредставление = Символ(Моджи.Юникод);
		Моджи.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДозаполнениеКатаканойНаСервере()
	
	Катакана = Катакана_Моджи();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Моджи.Наименование КАК Наименование,
	|	Моджи.НаименованиеНаРусском КАК НаименованиеНаРусском
	|ИЗ
	|	Справочник.Моджи КАК Моджи
	|ГДЕ
	|	Моджи.ПометкаУдаления = ЛОЖЬ
	|	И Моджи.ЭтоКатакана = ЛОЖЬ
	|	И Моджи.ЭтоМиниСимвол = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Моджи.Код";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	СоответствиеРЮ = АзбукаВызовСервера.СоответствиеРомаджиЮникоду();
	
	Пока Выборка.Следующий() Цикл
		
		Существующий = Катакана.Найти(Выборка.Наименование);
		Если Существующий <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Моджи = Справочники.Моджи.СоздатьЭлемент();
		Моджи.Наименование = Выборка.Наименование;
		Моджи.НаименованиеНаРусском = Выборка.НаименованиеНаРусском;
		Моджи.ЭтоКатакана = Истина;
		Юникод = СоответствиеРЮ.Получить(НРег(Выборка.Наименование)).ЮникодКатакана;
		Моджи.Юникод = ЧислоИзШестнадцатеричнойСтроки(Юникод);
		Моджи.ЮникодПредставление = Символ(Моджи.Юникод);
		Моджи.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДозаполнениеМиниСимволамиНаСервере()
	
	МиниМоджи = Мини_Моджи();
	СоответствиеРЮ = АзбукаВызовСервера.СоответствиеРомаджиЮникоду();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Моджи.Наименование КАК Наименование,
	|	Моджи.НаименованиеНаРусском КАК НаименованиеНаРусском,
	|	Моджи.ЭтоКатакана КАК ЭтоКатакана
	|ИЗ
	|	Справочник.Моджи КАК Моджи
	|ГДЕ
	|	Моджи.ПометкаУдаления = ЛОЖЬ
	|	И Моджи.ЭтоМиниСимвол = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Моджи.Код";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Существующий = МиниМоджи.Найти(Выборка.Наименование);
		Если Существующий <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Ромаджи = Нрег(Выборка.Наименование);
		Данные = СоответствиеРЮ.Получить(Ромаджи);
			
		Если Выборка.ЭтоКатакана Тогда
			ЕстьМини = Данные.ЮникодМиниКатакана <> Неопределено;
			ЮникодМини = Данные.ЮникодМиниКатакана;
		Иначе
			ЕстьМини = Данные.ЮникодМини <> Неопределено;	
			ЮникодМини = Данные.ЮникодМини;
		КонецЕсли;
		Если ЕстьМини = Ложь Тогда
			Продолжить;
		КонецЕсли;
		
		Моджи = Справочники.Моджи.СоздатьЭлемент();
		Моджи.Наименование = Выборка.Наименование;
		Моджи.НаименованиеНаРусском = Выборка.НаименованиеНаРусском;
		Моджи.ЭтоКатакана = Выборка.ЭтоКатакана;
		Моджи.ЭтоМиниСимвол = Истина;
		Моджи.Юникод = ЧислоИзШестнадцатеричнойСтроки(ЮникодМини);
		Моджи.ЮникодПредставление = Символ(Моджи.Юникод);
		Моджи.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция Катакана_Моджи()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Моджи.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Моджи КАК Моджи
	|ГДЕ
	|	Моджи.ПометкаУдаления = ЛОЖЬ
	|	И Моджи.ЭтоКатакана = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Моджи = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Моджи.Добавить(Выборка.Наименование);
	КонецЦикла;
	Возврат Моджи;
	
КонецФункции

&НаСервере
Функция Мини_Моджи()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Моджи.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Моджи КАК Моджи
	|ГДЕ
	|	Моджи.ПометкаУдаления = ЛОЖЬ
	|	И Моджи.ЭтоМиниСимвол = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Моджи = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Моджи.Добавить(Выборка.Наименование);
	КонецЦикла;
	Возврат Моджи;
	
КонецФункции

#КонецОбласти
